"""
Задача 5 - task5

Напишите программу,
 которая принимает на вход 
 координаты двух точек и находит 
 расстояние между ними в 2D пространстве.

Пример:

- A (3,6); B (2,1) -> 5,09
- A (7,-5); B (1,-1) -> 7,21
"""

A = [int(i) for i in input("A = ").split(",")]
B = [int(i) for i in input("B = ").split(",")]

x = (A[0] - B[0]) * (A[0] - B[0])
y = (A[1] - B[1]) * (A[1] - B[1])
c = (x + y)**0.5
print(f"Расстояние между точками: {round(c, 2)}")
